GopalSaraf/Practicals/PSDL/include/proc/pic16f753.inc
// Register: OSCCON
#define OSCCON OSCCON
OSCCON                                   equ 008Fh
// bitfield definitions
OSCCON_LTS_POSN                          equ 0001h
OSCCON_LTS_POSITION                      equ 0001h
OSCCON_LTS_SIZE                          equ 0001h
OSCCON_LTS_LENGTH                        equ 0001h
OSCCON_LTS_MASK                          equ 0002h
OSCCON_HTS_POSN                          equ 0002h
OSCCON_HTS_POSITION                      equ 0002h
OSCCON_HTS_SIZE                          equ 0001h
OSCCON_HTS_LENGTH                        equ 0001h
OSCCON_HTS_MASK                          equ 0004h
OSCCON_IRCF_POSN                         equ 0004h
OSCCON_IRCF_POSITION                     equ 0004h
OSCCON_IRCF_SIZE                         equ 0002h
OSCCON_IRCF_LENGTH                       equ 0002h
OSCCON_IRCF_MASK                         equ 0030h
OSCCON_IRCF0_POSN                        equ 0004h
OSCCON_IRCF0_POSITION                    equ 0004h
OSCCON_IRCF0_SIZE                        equ 0001h
OSCCON_IRCF0_LENGTH                      equ 0001h
OSCCON_IRCF0_MASK                        equ 0010h
OSCCON_IRCF1_POSN                        equ 0005h
OSCCON_IRCF1_POSITION                    equ 0005h
OSCCON_IRCF1_SIZE                        equ 0001h
OSCCON_IRCF1_LENGTH                      equ 0001h
OSCCON_IRCF1_MASK                        equ 0020h

// Register: FVR1CON0
#define FVR1CON0 FVR1CON0
FVR1CON0                                 equ 0090h
// bitfield definitions
FVR1CON0_FVRBUFEN_POSN                   equ 0000h
FVR1CON0_FVRBUFEN_POSITION               equ 0000h
FVR1CON0_FVRBUFEN_SIZE                   equ 0001h
FVR1CON0_FVRBUFEN_LENGTH                 equ 0001h
FVR1CON0_FVRBUFEN_MASK                   equ 0001h
FVR1CON0_FVRBUFSS0_POSN                  equ 0003h
FVR1CON0_FVRBUFSS0_POSITION              equ 0003h
FVR1CON0_FVRBUFSS0_SIZE                  equ 0002h
FVR1CON0_FVRBUFSS0_LENGTH                equ 0002h
FVR1CON0_FVRBUFSS0_MASK                  equ 0018h
FVR1CON0_FVROE_POSN                      equ 0005h
FVR1CON0_FVROE_POSITION                  equ 0005h
FVR1CON0_FVROE_SIZE                      equ 0001h
FVR1CON0_FVROE_LENGTH                    equ 0001h
FVR1CON0_FVROE_MASK                      equ 0020h
FVR1CON0_FVRRDY_POSN                     equ 0006h
FVR1CON0_FVRRDY_POSITION                 equ 0006h
FVR1CON0_FVRRDY_SIZE                     equ 0001h
FVR1CON0_FVRRDY_LENGTH                   equ 0001h
FVR1CON0_FVRRDY_MASK                     equ 0040h
FVR1CON0_FVREN_POSN                      equ 0007h
FVR1CON0_FVREN_POSITION                  equ 0007h
FVR1CON0_FVREN_SIZE                      equ 0001h
FVR1CON0_FVREN_LENGTH                    equ 0001h
FVR1CON0_FVREN_MASK                      equ 0080h
FVR1CON0_FVRBUSS0_POSN                   equ 0003h
FVR1CON0_FVRBUSS0_POSITION               equ 0003h
FVR1CON0_FVRBUSS0_SIZE                   equ 0001h
FVR1CON0_FVRBUSS0_LENGTH                 equ 0001h
FVR1CON0_FVRBUSS0_MASK                   equ 0008h
FVR1CON0_FVRBUSS1_POSN                   equ 0004h
FVR1CON0_FVRBUSS1_POSITION               equ 0004h
FVR1CON0_FVRBUSS1_SIZE                   equ 0001h
FVR1CON0_FVRBUSS1_LENGTH                 equ 0001h
FVR1CON0_FVRBUSS1_MASK                   equ 0010h

// Register: DAC1CON0
#define DAC1CON0 DAC1CON0
DAC1CON0                                 equ 0091h
// bitfield definitions
DAC1CON0_DACPSS_POSN                     equ 0002h
DAC1CON0_DACPSS_POSITION                 equ 0002h
DAC1CON0_DACPSS_SIZE                     equ 0002h
DAC1CON0_DACPSS_LENGTH                   equ 0002h
DAC1CON0_DACPSS_MASK                     equ 000Ch
DAC1CON0_DACOE_POSN                      equ 0005h
DAC1CON0_DACOE_POSITION                  equ 0005h
DAC1CON0_DACOE_SIZE                      equ 0001h
DAC1CON0_DACOE_LENGTH                    equ 0001h
DAC1CON0_DACOE_MASK                      equ 0020h
DAC1CON0_DACFM_POSN                      equ 0006h
DAC1CON0_DACFM_POSITION                  equ 0006h
DAC1CON0_DACFM_SIZE                      equ 0001h
DAC1CON0_DACFM_LENGTH                    equ 0001h
DAC1CON0_DACFM_MASK                      equ 0040h
DAC1CON0_DACEN_POSN                      equ 0007h
DAC1CON0_DACEN_POSITION                  equ 0007h
DAC1CON0_DACEN_SIZE                      equ 0001h
DAC1CON0_DACEN_LENGTH                    equ 0001h
DAC1CON0_DACEN_MASK                      equ 0080h
DAC1CON0_DACPSS0_POSN                    equ 0002h
DAC1CON0_DACPSS0_POSITION                equ 0002h
DAC1CON0_DACPSS0_SIZE                    equ 0001h
DAC1CON0_DACPSS0_LENGTH                  equ 0001h
DAC1CON0_DACPSS0_MASK                    equ 0004h
DAC1CON0_DACPSS1_POSN                    equ 0003h
DAC1CON0_DACPSS1_POSITION                equ 0003h
DAC1CON0_DACPSS1_SIZE                    equ 0001h
DAC1CON0_DACPSS1_LENGTH                  equ 0001h
DAC1CON0_DACPSS1_MASK                    equ 0008h

// Register: DAC1REFL
#define DAC1REFL DAC1REFL
DAC1REFL                                 equ 0092h
// bitfield definitions
DAC1REFL_DACR_POSN                       equ 0000h
DAC1REFL_DACR_POSITION                   equ 0000h
DAC1REFL_DACR_SIZE                       equ 0008h
DAC1REFL_DACR_LENGTH                     equ 0008h
DAC1REFL_DACR_MASK                       equ 00FFh

// Register: DAC1REFH
#define DAC1REFH DAC1REFH
DAC1REFH                                 equ 0093h
// bitfield definitions
DAC1REFH_DACR_POSN                       equ 0000h
DAC1REFH_DACR_POSITION                   equ 0000h
DAC1REFH_DACR_SIZE                       equ 0008h
DAC1REFH_DACR_LENGTH                     equ 0008h
DAC1REFH_DACR_MASK                       equ 00FFh

// Register: OPA1CON
#define OPA1CON OPA1CON
OPA1CON                                  equ 0096h
// bitfield definitions
OPA1CON_OPA1PCH_POSN                     equ 0000h
OPA1CON_OPA1PCH_POSITION                 equ 0000h
OPA1CON_OPA1PCH_SIZE                     equ 0002h
OPA1CON_OPA1PCH_LENGTH                   equ 0002h
OPA1CON_OPA1PCH_MASK                     equ 0003h
OPA1CON_OPA1NCH_POSN                     equ 0002h
OPA1CON_OPA1NCH_POSITION                 equ 0002h
OPA1CON_OPA1NCH_SIZE                     equ 0002h
OPA1CON_OPA1NCH_LENGTH                   equ 0002h
OPA1CON_OPA1NCH_MASK                     equ 000Ch
OPA1CON_OPAUGM_POSN                      equ 0004h
OPA1CON_OPAUGM_POSITION                  equ 0004h
OPA1CON_OPAUGM_SIZE                      equ 0001h
OPA1CON_OPAUGM_LENGTH                    equ 0001h
OPA1CON_OPAUGM_MASK                      equ 0010h
OPA1CON_OPAEN_POSN                       equ 0007h
OPA1CON_OPAEN_POSITION                   equ 0007h
OPA1CON_OPAEN_SIZE                       equ 0001h
OPA1CON_OPAEN_LENGTH                     equ 0001h
OPA1CON_OPAEN_MASK                       equ 0080h
OPA1CON_OPA1PCH0_POSN                    equ 0000h
OPA1CON_OPA1PCH0_POSITION                equ 0000h
OPA1CON_OPA1PCH0_SIZE                    equ 0001h
OPA1CON_OPA1PCH0_LENGTH                  equ 0001h
OPA1CON_OPA1PCH0_MASK                    equ 0001h
OPA1CON_OPA1PCH1_POSN                    equ 0001h
OPA1CON_OPA1PCH1_POSITION                equ 0001h
OPA1CON_OPA1PCH1_SIZE                    equ 0001h
OPA1CON_OPA1PCH1_LENGTH                  equ 0001h
OPA1CON_OPA1PCH1_MASK                    equ 0002h
OPA1CON_OPA1NCH0_POSN                    equ 0002h
OPA1CON_OPA1NCH0_POSITION                equ 0002h
OPA1CON_OPA1NCH0_SIZE                    equ 0001h
OPA1CON_OPA1NCH0_LENGTH                  equ 0001h
OPA1CON_OPA1NCH0_MASK                    equ 0004h
OPA1CON_OPA1NCH1_POSN                    equ 0003h
OPA1CON_OPA1NCH1_POSITION                equ 0003h
OPA1CON_OPA1NCH1_SIZE                    equ 0001h
OPA1CON_OPA1NCH1_LENGTH                  equ 0001h
OPA1CON_OPA1NCH1_MASK                    equ 0008h

// Register: CM2CON0
#define CM2CON0 CM2CON0
CM2CON0                                  equ 009Bh
// bitfield definitions
CM2CON0_C2SYNC_POSN                      equ 0000h
CM2CON0_C2SYNC_POSITION                  equ 0000h
CM2CON0_C2SYNC_SIZE                      equ 0001h
CM2CON0_C2SYNC_LENGTH                    equ 0001h
CM2CON0_C2SYNC_MASK                      equ 0001h
CM2CON0_C2HYS_POSN                       equ 0001h
CM2CON0_C2HYS_POSITION                   equ 0001h
CM2CON0_C2HYS_SIZE                       equ 0001h
CM2CON0_C2HYS_LENGTH                     equ 0001h
CM2CON0_C2HYS_MASK                       equ 0002h
CM2CON0_C2SP_POSN                        equ 0002h
CM2CON0_C2SP_POSITION                    equ 0002h
CM2CON0_C2SP_SIZE                        equ 0001h
CM2CON0_C2SP_LENGTH                      equ 0001h
CM2CON0_C2SP_MASK                        equ 0004h
CM2CON0_C2ZLF_POSN                       equ 0003h
CM2CON0_C2ZLF_POSITION                   equ 0003h
CM2CON0_C2ZLF_SIZE                       equ 0001h
CM2CON0_C2ZLF_LENGTH                     equ 0001h
CM2CON0_C2ZLF_MASK                       equ 0008h
CM2CON0_C2POL_POSN                       equ 0004h
CM2CON0_C2POL_POSITION                   equ 0004h
CM2CON0_C2POL_SIZE                       equ 0001h
CM2CON0_C2POL_LENGTH                     equ 0001h
CM2CON0_C2POL_MASK                       equ 0010h
CM2CON0_C2OE_POSN                        equ 0005h
CM2CON0_C2OE_POSITION                    equ 0005h
CM2CON0_C2OE_SIZE                        equ 0001h
CM2CON0_C2OE_LENGTH                      equ 0001h
CM2CON0_C2OE_MASK                        equ 0020h
CM2CON0_C2OUT_POSN                       equ 0006h
CM2CON0_C2OUT_POSITION                   equ 0006h
CM2CON0_C2OUT_SIZE                       equ 0001h
CM2CON0_C2OUT_LENGTH                     equ 0001h
CM2CON0_C2OUT_MASK                       equ 0040h
CM2CON0_C2ON_POSN                        equ 0007h
CM2CON0_C2ON_POSITION                    equ 0007h
CM2CON0_C2ON_SIZE                        equ 0001h
CM2CON0_C2ON_LENGTH                      equ 0001h
CM2CON0_C2ON_MASK                        equ 0080h

// Register: CM2CON1
#define CM2CON1 CM2CON1
CM2CON1                                  equ 009Ch
// bitfield definitions
CM2CON1_C2NCH_POSN                       equ 0000h
CM2CON1_C2NCH_POSITION                   equ 0000h
CM2CON1_C2NCH_SIZE                       equ 0003h
CM2CON1_C2NCH_LENGTH                     equ 0003h
CM2CON1_C2NCH_MASK                       equ 0007h
CM2CON1_C2PCH_POSN                       equ 0003h
CM2CON1_C2PCH_POSITION                   equ 0003h
CM2CON1_C2PCH_SIZE                       equ 0003h
CM2CON1_C2PCH_LENGTH                     equ 0003h
CM2CON1_C2PCH_MASK                       equ 0038h
CM2CON1_C2INTN_POSN                      equ 0006h
CM2CON1_C2INTN_POSITION                  equ 0006h
CM2CON1_C2INTN_SIZE                      equ 0001h
CM2CON1_C2INTN_LENGTH                    equ 0001h
CM2CON1_C2INTN_MASK                      equ 0040h
CM2CON1_C2INTP_POSN                      equ 0007h
CM2CON1_C2INTP_POSITION                  equ 0007h
CM2CON1_C2INTP_SIZE                      equ 0001h
CM2CON1_C2INTP_LENGTH                    equ 0001h
CM2CON1_C2INTP_MASK                      equ 0080h
CM2CON1_C2NCH0_POSN                      equ 0000h
CM2CON1_C2NCH0_POSITION                  equ 0000h
CM2CON1_C2NCH0_SIZE                      equ 0001h
CM2CON1_C2NCH0_LENGTH                    equ 0001h
CM2CON1_C2NCH0_MASK                      equ 0001h
CM2CON1_C2NCH1_POSN                      equ 0001h
CM2CON1_C2NCH1_POSITION                  equ 0001h
CM2CON1_C2NCH1_SIZE                      equ 0001h
CM2CON1_C2NCH1_LENGTH                    equ 0001h
CM2CON1_C2NCH1_MASK                      equ 0002h
CM2CON1_C2NCH2_POSN                      equ 0002h
CM2CON1_C2NCH2_POSITION                  equ 0002h
CM2CON1_C2NCH2_SIZE                      equ 0001h
CM2CON1_C2NCH2_LENGTH                    equ 0001h
CM2CON1_C2NCH2_MASK                      equ 0004h
CM2CON1_C2PCH0_POSN                      equ 0003h
CM2CON1_C2PCH0_POSITION                  equ 0003h
CM2CON1_C2PCH0_SIZE                      equ 0001h
CM2CON1_C2PCH0_LENGTH                    equ 0001h
CM2CON1_C2PCH0_MASK                      equ 0008h
CM2CON1_C2PCH1_POSN                      equ 0004h
CM2CON1_C2PCH1_POSITION                  equ 0004h
CM2CON1_C2PCH1_SIZE                      equ 0001h
CM2CON1_C2PCH1_LENGTH                    equ 0001h
CM2CON1_C2PCH1_MASK                      equ 0010h
CM2CON1_C2PCH2_POSN                      equ 0005h
CM2CON1_C2PCH2_POSITION                  equ 0005h
CM2CON1_C2PCH2_SIZE                      equ 0001h
CM2CON1_C2PCH2_LENGTH                    equ 0001h
CM2CON1_C2PCH2_MASK                      equ 0020h

// Register: CM1CON0
#define CM1CON0 CM1CON0
CM1CON0                                  equ 009Dh
// bitfield definitions
CM1CON0_C1SYNC_POSN                      equ 0000h
CM1CON0_C1SYNC_POSITION                  equ 0000h
CM1CON0_C1SYNC_SIZE                      equ 0001h
CM1CON0_C1SYNC_LENGTH                    equ 0001h
CM1CON0_C1SYNC_MASK                      equ 0001h
CM1CON0_C1HYS_POSN                       equ 0001h
CM1CON0_C1HYS_POSITION                   equ 0001h
CM1CON0_C1HYS_SIZE                       equ 0001h
CM1CON0_C1HYS_LENGTH                     equ 0001h
CM1CON0_C1HYS_MASK                       equ 0002h
CM1CON0_C1SP_POSN                        equ 0002h
CM1CON0_C1SP_POSITION                    equ 0002h
CM1CON0_C1SP_SIZE                        equ 0001h
CM1CON0_C1SP_LENGTH                      equ 0001h
CM1CON0_C1SP_MASK                        equ 0004h
CM1CON0_C1ZLF_POSN                       equ 0003h
CM1CON0_C1ZLF_POSITION                   equ 0003h
CM1CON0_C1ZLF_SIZE                       equ 0001h
CM1CON0_C1ZLF_LENGTH                     equ 0001h
CM1CON0_C1ZLF_MASK                       equ 0008h
CM1CON0_C1POL_POSN                       equ 0004h
CM1CON0_C1POL_POSITION                   equ 0004h
CM1CON0_C1POL_SIZE                       equ 0001h
CM1CON0_C1POL_LENGTH                     equ 0001h
CM1CON0_C1POL_MASK                       equ 0010h
CM1CON0_C1OE_POSN                        equ 0005h
CM1CON0_C1OE_POSITION                    equ 0005h
CM1CON0_C1OE_SIZE                        equ 0001h
CM1CON0_C1OE_LENGTH                      equ 0001h
CM1CON0_C1OE_MASK                        equ 0020h
CM1CON0_C1OUT_POSN                       equ 0006h
CM1CON0_C1OUT_POSITION                   equ 0006h
CM1CON0_C1OUT_SIZE                       equ 0001h
CM1CON0_C1OUT_LENGTH                     equ 0001h
CM1CON0_C1OUT_MASK                       equ 0040h
CM1CON0_C1ON_POSN                        equ 0007h
CM1CON0_C1ON_POSITION                    equ 0007h
CM1CON0_C1ON_SIZE                        equ 0001h
CM1CON0_C1ON_LENGTH                      equ 0001h
CM1CON0_C1ON_MASK                        equ 0080h

// Register: CM1CON1
#define CM1CON1 CM1CON1
CM1CON1                                  equ 009Eh
// bitfield definitions
CM1CON1_C1NCH_POSN                       equ 0000h
CM1CON1_C1NCH_POSITION                   equ 0000h
CM1CON1_C1NCH_SIZE                       equ 0003h
CM1CON1_C1NCH_LENGTH                     equ 0003h
CM1CON1_C1NCH_MASK                       equ 0007h
CM1CON1_C1PCH_POSN                       equ 0003h
CM1CON1_C1PCH_POSITION                   equ 0003h
CM1CON1_C1PCH_SIZE                       equ 0003h
CM1CON1_C1PCH_LENGTH                     equ 0003h
CM1CON1_C1PCH_MASK                       equ 0038h
CM1CON1_C1INTN_POSN                      equ 0006h
CM1CON1_C1INTN_POSITION                  equ 0006h
CM1CON1_C1INTN_SIZE                      equ 0001h
CM1CON1_C1INTN_LENGTH                    equ 0001h
CM1CON1_C1INTN_MASK                      equ 0040h
CM1CON1_C1INTP_POSN                      equ 0007h
CM1CON1_C1INTP_POSITION                  equ 0007h
CM1CON1_C1INTP_SIZE                      equ 0001h
CM1CON1_C1INTP_LENGTH                    equ 0001h
CM1CON1_C1INTP_MASK                      equ 0080h
CM1CON1_C1NCH0_POSN                      equ 0000h
CM1CON1_C1NCH0_POSITION                  equ 0000h
CM1CON1_C1NCH0_SIZE                      equ 0001h
CM1CON1_C1NCH0_LENGTH                    equ 0001h
CM1CON1_C1NCH0_MASK                      equ 0001h
CM1CON1_C1NCH1_POSN                      equ 0001h
CM1CON1_C1NCH1_POSITION                  equ 0001h
CM1CON1_C1NCH1_SIZE                      equ 0001h
CM1CON1_C1NCH1_LENGTH                    equ 0001h
CM1CON1_C1NCH1_MASK                      equ 0002h
CM1CON1_C1NCH2_POSN                      equ 0002h
CM1CON1_C1NCH2_POSITION                  equ 0002h
CM1CON1_C1NCH2_SIZE                      equ 0001h
CM1CON1_C1NCH2_LENGTH                    equ 0001h
CM1CON1_C1NCH2_MASK                      equ 0004h
CM1CON1_C1PCH0_POSN                      equ 0003h
CM1CON1_C1PCH0_POSITION                  equ 0003h
CM1CON1_C1PCH0_SIZE                      equ 0001h
CM1CON1_C1PCH0_LENGTH                    equ 0001h
CM1CON1_C1PCH0_MASK                      equ 0008h
CM1CON1_C1PCH1_POSN                      equ 0004h
CM1CON1_C1PCH1_POSITION                  equ 0004h
CM1CON1_C1PCH1_SIZE                      equ 0001h
CM1CON1_C1PCH1_LENGTH                    equ 0001h
CM1CON1_C1PCH1_MASK                      equ 0010h
CM1CON1_C1PCH2_POSN                      equ 0005h
CM1CON1_C1PCH2_POSITION                  equ 0005h
CM1CON1_C1PCH2_SIZE                      equ 0001h
CM1CON1_C1PCH2_LENGTH                    equ 0001h
CM1CON1_C1PCH2_MASK                      equ 0020h

// Register: CMOUT
#define CMOUT CMOUT
CMOUT                                    equ 009Fh
// bitfield definitions
CMOUT_MCOUT1_POSN                        equ 0000h
CMOUT_MCOUT1_POSITION                    equ 0000h
CMOUT_MCOUT1_SIZE                        equ 0001h
CMOUT_MCOUT1_LENGTH                      equ 0001h
CMOUT_MCOUT1_MASK                        equ 0001h
CMOUT_MCOUT2_POSN                        equ 0001h
CMOUT_MCOUT2_POSITION                    equ 0001h
CMOUT_MCOUT2_SIZE                        equ 0001h
CMOUT_MCOUT2_LENGTH                      equ 0001h
CMOUT_MCOUT2_MASK                        equ 0002h

