GopalSaraf/Practicals/PSDL/include/proc/pic16f753.inc
// Register: HLTPR1
#define HLTPR1 HLTPR1
HLTPR1                                   equ 0114h
// bitfield definitions
HLTPR1_HLTPR1_POSN                       equ 0000h
HLTPR1_HLTPR1_POSITION                   equ 0000h
HLTPR1_HLTPR1_SIZE                       equ 0008h
HLTPR1_HLTPR1_LENGTH                     equ 0008h
HLTPR1_HLTPR1_MASK                       equ 00FFh

// Register: HLT1CON0
#define HLT1CON0 HLT1CON0
HLT1CON0                                 equ 0115h
// bitfield definitions
HLT1CON0_H1CKPS_POSN                     equ 0000h
HLT1CON0_H1CKPS_POSITION                 equ 0000h
HLT1CON0_H1CKPS_SIZE                     equ 0002h
HLT1CON0_H1CKPS_LENGTH                   equ 0002h
HLT1CON0_H1CKPS_MASK                     equ 0003h
HLT1CON0_H1ON_POSN                       equ 0002h
HLT1CON0_H1ON_POSITION                   equ 0002h
HLT1CON0_H1ON_SIZE                       equ 0001h
HLT1CON0_H1ON_LENGTH                     equ 0001h
HLT1CON0_H1ON_MASK                       equ 0004h
HLT1CON0_H1OUTPS_POSN                    equ 0003h
HLT1CON0_H1OUTPS_POSITION                equ 0003h
HLT1CON0_H1OUTPS_SIZE                    equ 0004h
HLT1CON0_H1OUTPS_LENGTH                  equ 0004h
HLT1CON0_H1OUTPS_MASK                    equ 0078h
HLT1CON0_H1CKPS0_POSN                    equ 0000h
HLT1CON0_H1CKPS0_POSITION                equ 0000h
HLT1CON0_H1CKPS0_SIZE                    equ 0001h
HLT1CON0_H1CKPS0_LENGTH                  equ 0001h
HLT1CON0_H1CKPS0_MASK                    equ 0001h
HLT1CON0_H1CKPS1_POSN                    equ 0001h
HLT1CON0_H1CKPS1_POSITION                equ 0001h
HLT1CON0_H1CKPS1_SIZE                    equ 0001h
HLT1CON0_H1CKPS1_LENGTH                  equ 0001h
HLT1CON0_H1CKPS1_MASK                    equ 0002h
HLT1CON0_H1OUTPS0_POSN                   equ 0003h
HLT1CON0_H1OUTPS0_POSITION               equ 0003h
HLT1CON0_H1OUTPS0_SIZE                   equ 0001h
HLT1CON0_H1OUTPS0_LENGTH                 equ 0001h
HLT1CON0_H1OUTPS0_MASK                   equ 0008h
HLT1CON0_H1OUTPS1_POSN                   equ 0004h
HLT1CON0_H1OUTPS1_POSITION               equ 0004h
HLT1CON0_H1OUTPS1_SIZE                   equ 0001h
HLT1CON0_H1OUTPS1_LENGTH                 equ 0001h
HLT1CON0_H1OUTPS1_MASK                   equ 0010h
HLT1CON0_H1OUTPS2_POSN                   equ 0005h
HLT1CON0_H1OUTPS2_POSITION               equ 0005h
HLT1CON0_H1OUTPS2_SIZE                   equ 0001h
HLT1CON0_H1OUTPS2_LENGTH                 equ 0001h
HLT1CON0_H1OUTPS2_MASK                   equ 0020h
HLT1CON0_H1OUTPS3_POSN                   equ 0006h
HLT1CON0_H1OUTPS3_POSITION               equ 0006h
HLT1CON0_H1OUTPS3_SIZE                   equ 0001h
HLT1CON0_H1OUTPS3_LENGTH                 equ 0001h
HLT1CON0_H1OUTPS3_MASK                   equ 0040h

// Register: HLT1CON1
#define HLT1CON1 HLT1CON1
HLT1CON1                                 equ 0116h
// bitfield definitions
HLT1CON1_H1REREN_POSN                    equ 0000h
HLT1CON1_H1REREN_POSITION                equ 0000h
HLT1CON1_H1REREN_SIZE                    equ 0001h
HLT1CON1_H1REREN_LENGTH                  equ 0001h
HLT1CON1_H1REREN_MASK                    equ 0001h
HLT1CON1_H1FEREN_POSN                    equ 0001h
HLT1CON1_H1FEREN_POSITION                equ 0001h
HLT1CON1_H1FEREN_SIZE                    equ 0001h
HLT1CON1_H1FEREN_LENGTH                  equ 0001h
HLT1CON1_H1FEREN_MASK                    equ 0002h
HLT1CON1_H1ERS_POSN                      equ 0002h
HLT1CON1_H1ERS_POSITION                  equ 0002h
HLT1CON1_H1ERS_SIZE                      equ 0003h
HLT1CON1_H1ERS_LENGTH                    equ 0003h
HLT1CON1_H1ERS_MASK                      equ 001Ch
HLT1CON1_H1RES_POSN                      equ 0006h
HLT1CON1_H1RES_POSITION                  equ 0006h
HLT1CON1_H1RES_SIZE                      equ 0001h
HLT1CON1_H1RES_LENGTH                    equ 0001h
HLT1CON1_H1RES_MASK                      equ 0040h
HLT1CON1_H1FES_POSN                      equ 0007h
HLT1CON1_H1FES_POSITION                  equ 0007h
HLT1CON1_H1FES_SIZE                      equ 0001h
HLT1CON1_H1FES_LENGTH                    equ 0001h
HLT1CON1_H1FES_MASK                      equ 0080h
HLT1CON1_H1ERS0_POSN                     equ 0002h
HLT1CON1_H1ERS0_POSITION                 equ 0002h
HLT1CON1_H1ERS0_SIZE                     equ 0001h
HLT1CON1_H1ERS0_LENGTH                   equ 0001h
HLT1CON1_H1ERS0_MASK                     equ 0004h
HLT1CON1_H1ERS1_POSN                     equ 0003h
HLT1CON1_H1ERS1_POSITION                 equ 0003h
HLT1CON1_H1ERS1_SIZE                     equ 0001h
HLT1CON1_H1ERS1_LENGTH                   equ 0001h
HLT1CON1_H1ERS1_MASK                     equ 0008h
HLT1CON1_H1ERS2_POSN                     equ 0004h
HLT1CON1_H1ERS2_POSITION                 equ 0004h
HLT1CON1_H1ERS2_SIZE                     equ 0001h
HLT1CON1_H1ERS2_LENGTH                   equ 0001h
HLT1CON1_H1ERS2_MASK                     equ 0010h

// Register: HLTMR2
#define HLTMR2 HLTMR2
HLTMR2                                   equ 0117h
// bitfield definitions
HLTMR2_HLTMR2_POSN                       equ 0000h
HLTMR2_HLTMR2_POSITION                   equ 0000h
HLTMR2_HLTMR2_SIZE                       equ 0008h
HLTMR2_HLTMR2_LENGTH                     equ 0008h
HLTMR2_HLTMR2_MASK                       equ 00FFh

// Register: HLTPR2
#define HLTPR2 HLTPR2
HLTPR2                                   equ 0118h
// bitfield definitions
HLTPR2_HLTPR2_POSN                       equ 0000h
HLTPR2_HLTPR2_POSITION                   equ 0000h
HLTPR2_HLTPR2_SIZE                       equ 0008h
HLTPR2_HLTPR2_LENGTH                     equ 0008h
HLTPR2_HLTPR2_MASK                       equ 00FFh

// Register: HLT2CON0
#define HLT2CON0 HLT2CON0
HLT2CON0                                 equ 0119h
// bitfield definitions
HLT2CON0_H2CKPS_POSN                     equ 0000h
HLT2CON0_H2CKPS_POSITION                 equ 0000h
HLT2CON0_H2CKPS_SIZE                     equ 0002h
HLT2CON0_H2CKPS_LENGTH                   equ 0002h
HLT2CON0_H2CKPS_MASK                     equ 0003h
HLT2CON0_H2ON_POSN                       equ 0002h
HLT2CON0_H2ON_POSITION                   equ 0002h
HLT2CON0_H2ON_SIZE                       equ 0001h
HLT2CON0_H2ON_LENGTH                     equ 0001h
HLT2CON0_H2ON_MASK                       equ 0004h
HLT2CON0_H2OUTPS_POSN                    equ 0003h
HLT2CON0_H2OUTPS_POSITION                equ 0003h
HLT2CON0_H2OUTPS_SIZE                    equ 0004h
HLT2CON0_H2OUTPS_LENGTH                  equ 0004h
HLT2CON0_H2OUTPS_MASK                    equ 0078h
HLT2CON0_H2CKPS0_POSN                    equ 0000h
HLT2CON0_H2CKPS0_POSITION                equ 0000h
HLT2CON0_H2CKPS0_SIZE                    equ 0001h
HLT2CON0_H2CKPS0_LENGTH                  equ 0001h
HLT2CON0_H2CKPS0_MASK                    equ 0001h
HLT2CON0_H2CKPS1_POSN                    equ 0001h
HLT2CON0_H2CKPS1_POSITION                equ 0001h
HLT2CON0_H2CKPS1_SIZE                    equ 0001h
HLT2CON0_H2CKPS1_LENGTH                  equ 0001h
HLT2CON0_H2CKPS1_MASK                    equ 0002h
HLT2CON0_H2OUTPS0_POSN                   equ 0003h
HLT2CON0_H2OUTPS0_POSITION               equ 0003h
HLT2CON0_H2OUTPS0_SIZE                   equ 0001h
HLT2CON0_H2OUTPS0_LENGTH                 equ 0001h
HLT2CON0_H2OUTPS0_MASK                   equ 0008h
HLT2CON0_H2OUTPS1_POSN                   equ 0004h
HLT2CON0_H2OUTPS1_POSITION               equ 0004h
HLT2CON0_H2OUTPS1_SIZE                   equ 0001h
HLT2CON0_H2OUTPS1_LENGTH                 equ 0001h
HLT2CON0_H2OUTPS1_MASK                   equ 0010h
HLT2CON0_H2OUTPS2_POSN                   equ 0005h
HLT2CON0_H2OUTPS2_POSITION               equ 0005h
HLT2CON0_H2OUTPS2_SIZE                   equ 0001h
HLT2CON0_H2OUTPS2_LENGTH                 equ 0001h
HLT2CON0_H2OUTPS2_MASK                   equ 0020h
HLT2CON0_H2OUTPS3_POSN                   equ 0006h
HLT2CON0_H2OUTPS3_POSITION               equ 0006h
HLT2CON0_H2OUTPS3_SIZE                   equ 0001h
HLT2CON0_H2OUTPS3_LENGTH                 equ 0001h
HLT2CON0_H2OUTPS3_MASK                   equ 0040h

// Register: HLT2CON1
#define HLT2CON1 HLT2CON1
HLT2CON1                                 equ 011Ah
// bitfield definitions
HLT2CON1_H2REREN_POSN                    equ 0000h
HLT2CON1_H2REREN_POSITION                equ 0000h
HLT2CON1_H2REREN_SIZE                    equ 0001h
HLT2CON1_H2REREN_LENGTH                  equ 0001h
HLT2CON1_H2REREN_MASK                    equ 0001h
HLT2CON1_H2FEREN_POSN                    equ 0001h
HLT2CON1_H2FEREN_POSITION                equ 0001h
HLT2CON1_H2FEREN_SIZE                    equ 0001h
HLT2CON1_H2FEREN_LENGTH                  equ 0001h
HLT2CON1_H2FEREN_MASK                    equ 0002h
HLT2CON1_H2ERS_POSN                      equ 0002h
HLT2CON1_H2ERS_POSITION                  equ 0002h
HLT2CON1_H2ERS_SIZE                      equ 0003h
HLT2CON1_H2ERS_LENGTH                    equ 0003h
HLT2CON1_H2ERS_MASK                      equ 001Ch
HLT2CON1_H2RES_POSN                      equ 0006h
HLT2CON1_H2RES_POSITION                  equ 0006h
HLT2CON1_H2RES_SIZE                      equ 0001h
HLT2CON1_H2RES_LENGTH                    equ 0001h
HLT2CON1_H2RES_MASK                      equ 0040h
HLT2CON1_H2FES_POSN                      equ 0007h
HLT2CON1_H2FES_POSITION                  equ 0007h
HLT2CON1_H2FES_SIZE                      equ 0001h
HLT2CON1_H2FES_LENGTH                    equ 0001h
HLT2CON1_H2FES_MASK                      equ 0080h
HLT2CON1_H2ERS0_POSN                     equ 0002h
HLT2CON1_H2ERS0_POSITION                 equ 0002h
HLT2CON1_H2ERS0_SIZE                     equ 0001h
HLT2CON1_H2ERS0_LENGTH                   equ 0001h
HLT2CON1_H2ERS0_MASK                     equ 0004h
HLT2CON1_H2ERS1_POSN                     equ 0003h
HLT2CON1_H2ERS1_POSITION                 equ 0003h
HLT2CON1_H2ERS1_SIZE                     equ 0001h
HLT2CON1_H2ERS1_LENGTH                   equ 0001h
HLT2CON1_H2ERS1_MASK                     equ 0008h
HLT2CON1_H2ERS2_POSN                     equ 0004h
HLT2CON1_H2ERS2_POSITION                 equ 0004h
HLT2CON1_H2ERS2_SIZE                     equ 0001h
HLT2CON1_H2ERS2_LENGTH                   equ 0001h
HLT2CON1_H2ERS2_MASK                     equ 0010h

