GopalSaraf/Practicals/PSDL/include/proc/pic16f753.inc
// Register: OSCTUNE
#define OSCTUNE OSCTUNE
OSCTUNE                                  equ 0189h
// bitfield definitions
OSCTUNE_TUN_POSN                         equ 0000h
OSCTUNE_TUN_POSITION                     equ 0000h
OSCTUNE_TUN_SIZE                         equ 0005h
OSCTUNE_TUN_LENGTH                       equ 0005h
OSCTUNE_TUN_MASK                         equ 001Fh
OSCTUNE_TUN0_POSN                        equ 0000h
OSCTUNE_TUN0_POSITION                    equ 0000h
OSCTUNE_TUN0_SIZE                        equ 0001h
OSCTUNE_TUN0_LENGTH                      equ 0001h
OSCTUNE_TUN0_MASK                        equ 0001h
OSCTUNE_TUN1_POSN                        equ 0001h
OSCTUNE_TUN1_POSITION                    equ 0001h
OSCTUNE_TUN1_SIZE                        equ 0001h
OSCTUNE_TUN1_LENGTH                      equ 0001h
OSCTUNE_TUN1_MASK                        equ 0002h
OSCTUNE_TUN2_POSN                        equ 0002h
OSCTUNE_TUN2_POSITION                    equ 0002h
OSCTUNE_TUN2_SIZE                        equ 0001h
OSCTUNE_TUN2_LENGTH                      equ 0001h
OSCTUNE_TUN2_MASK                        equ 0004h
OSCTUNE_TUN3_POSN                        equ 0003h
OSCTUNE_TUN3_POSITION                    equ 0003h
OSCTUNE_TUN3_SIZE                        equ 0001h
OSCTUNE_TUN3_LENGTH                      equ 0001h
OSCTUNE_TUN3_MASK                        equ 0008h
OSCTUNE_TUN4_POSN                        equ 0004h
OSCTUNE_TUN4_POSITION                    equ 0004h
OSCTUNE_TUN4_SIZE                        equ 0001h
OSCTUNE_TUN4_LENGTH                      equ 0001h
OSCTUNE_TUN4_MASK                        equ 0010h

// Register: PMCON1
#define PMCON1 PMCON1
PMCON1                                   equ 018Ch
// bitfield definitions
PMCON1_RD_POSN                           equ 0000h
PMCON1_RD_POSITION                       equ 0000h
PMCON1_RD_SIZE                           equ 0001h
PMCON1_RD_LENGTH                         equ 0001h
PMCON1_RD_MASK                           equ 0001h
PMCON1_WR_POSN                           equ 0001h
PMCON1_WR_POSITION                       equ 0001h
PMCON1_WR_SIZE                           equ 0001h
PMCON1_WR_LENGTH                         equ 0001h
PMCON1_WR_MASK                           equ 0002h
PMCON1_WREN_POSN                         equ 0002h
PMCON1_WREN_POSITION                     equ 0002h
PMCON1_WREN_SIZE                         equ 0001h
PMCON1_WREN_LENGTH                       equ 0001h
PMCON1_WREN_MASK                         equ 0004h

// Register: PMCON2
#define PMCON2 PMCON2
PMCON2                                   equ 018Dh
// bitfield definitions
PMCON2_PMCON2_POSN                       equ 0000h
PMCON2_PMCON2_POSITION                   equ 0000h
PMCON2_PMCON2_SIZE                       equ 0008h
PMCON2_PMCON2_LENGTH                     equ 0008h
PMCON2_PMCON2_MASK                       equ 00FFh

// Register: PMADRL
#define PMADRL PMADRL
PMADRL                                   equ 018Eh
// bitfield definitions
PMADRL_PMADRL_POSN                       equ 0000h
PMADRL_PMADRL_POSITION                   equ 0000h
PMADRL_PMADRL_SIZE                       equ 0008h
PMADRL_PMADRL_LENGTH                     equ 0008h
PMADRL_PMADRL_MASK                       equ 00FFh

// Register: PMADRH
#define PMADRH PMADRH
PMADRH                                   equ 018Fh
// bitfield definitions
PMADRH_PMADRH_POSN                       equ 0000h
PMADRH_PMADRH_POSITION                   equ 0000h
PMADRH_PMADRH_SIZE                       equ 0003h
PMADRH_PMADRH_LENGTH                     equ 0003h
PMADRH_PMADRH_MASK                       equ 0007h

// Register: PMDATL
#define PMDATL PMDATL
PMDATL                                   equ 0190h
// bitfield definitions
PMDATL_PMDATL_POSN                       equ 0000h
PMDATL_PMDATL_POSITION                   equ 0000h
PMDATL_PMDATL_SIZE                       equ 0008h
PMDATL_PMDATL_LENGTH                     equ 0008h
PMDATL_PMDATL_MASK                       equ 00FFh

// Register: PMDATH
#define PMDATH PMDATH
PMDATH                                   equ 0191h
// bitfield definitions
PMDATH_PMDATH_POSN                       equ 0000h
PMDATH_PMDATH_POSITION                   equ 0000h
PMDATH_PMDATH_SIZE                       equ 0006h
PMDATH_PMDATH_LENGTH                     equ 0006h
PMDATH_PMDATH_MASK                       equ 003Fh

// Register: COG1PHR
#define COG1PHR COG1PHR
COG1PHR                                  equ 0192h
// bitfield definitions
COG1PHR_G1PHR_POSN                       equ 0000h
COG1PHR_G1PHR_POSITION                   equ 0000h
COG1PHR_G1PHR_SIZE                       equ 0004h
COG1PHR_G1PHR_LENGTH                     equ 0004h
COG1PHR_G1PHR_MASK                       equ 000Fh
COG1PHR_G1PHR0_POSN                      equ 0000h
COG1PHR_G1PHR0_POSITION                  equ 0000h
COG1PHR_G1PHR0_SIZE                      equ 0001h
COG1PHR_G1PHR0_LENGTH                    equ 0001h
COG1PHR_G1PHR0_MASK                      equ 0001h
COG1PHR_G1PHR1_POSN                      equ 0001h
COG1PHR_G1PHR1_POSITION                  equ 0001h
COG1PHR_G1PHR1_SIZE                      equ 0001h
COG1PHR_G1PHR1_LENGTH                    equ 0001h
COG1PHR_G1PHR1_MASK                      equ 0002h
COG1PHR_G1PHR2_POSN                      equ 0002h
COG1PHR_G1PHR2_POSITION                  equ 0002h
COG1PHR_G1PHR2_SIZE                      equ 0001h
COG1PHR_G1PHR2_LENGTH                    equ 0001h
COG1PHR_G1PHR2_MASK                      equ 0004h
COG1PHR_G1PHR3_POSN                      equ 0003h
COG1PHR_G1PHR3_POSITION                  equ 0003h
COG1PHR_G1PHR3_SIZE                      equ 0001h
COG1PHR_G1PHR3_LENGTH                    equ 0001h
COG1PHR_G1PHR3_MASK                      equ 0008h

// Register: COG1PHF
#define COG1PHF COG1PHF
COG1PHF                                  equ 0193h
// bitfield definitions
COG1PHF_G1PHF_POSN                       equ 0000h
COG1PHF_G1PHF_POSITION                   equ 0000h
COG1PHF_G1PHF_SIZE                       equ 0004h
COG1PHF_G1PHF_LENGTH                     equ 0004h
COG1PHF_G1PHF_MASK                       equ 000Fh
COG1PHF_G1PHF0_POSN                      equ 0000h
COG1PHF_G1PHF0_POSITION                  equ 0000h
COG1PHF_G1PHF0_SIZE                      equ 0001h
COG1PHF_G1PHF0_LENGTH                    equ 0001h
COG1PHF_G1PHF0_MASK                      equ 0001h
COG1PHF_G1PHF1_POSN                      equ 0001h
COG1PHF_G1PHF1_POSITION                  equ 0001h
COG1PHF_G1PHF1_SIZE                      equ 0001h
COG1PHF_G1PHF1_LENGTH                    equ 0001h
COG1PHF_G1PHF1_MASK                      equ 0002h
COG1PHF_G1PHF2_POSN                      equ 0002h
COG1PHF_G1PHF2_POSITION                  equ 0002h
COG1PHF_G1PHF2_SIZE                      equ 0001h
COG1PHF_G1PHF2_LENGTH                    equ 0001h
COG1PHF_G1PHF2_MASK                      equ 0004h
COG1PHF_G1PHF3_POSN                      equ 0003h
COG1PHF_G1PHF3_POSITION                  equ 0003h
COG1PHF_G1PHF3_SIZE                      equ 0001h
COG1PHF_G1PHF3_LENGTH                    equ 0001h
COG1PHF_G1PHF3_MASK                      equ 0008h

// Register: COG1BKR
#define COG1BKR COG1BKR
COG1BKR                                  equ 0194h
// bitfield definitions
COG1BKR_G1BKR_POSN                       equ 0000h
COG1BKR_G1BKR_POSITION                   equ 0000h
COG1BKR_G1BKR_SIZE                       equ 0004h
COG1BKR_G1BKR_LENGTH                     equ 0004h
COG1BKR_G1BKR_MASK                       equ 000Fh
COG1BKR_G1BKR0_POSN                      equ 0000h
COG1BKR_G1BKR0_POSITION                  equ 0000h
COG1BKR_G1BKR0_SIZE                      equ 0001h
COG1BKR_G1BKR0_LENGTH                    equ 0001h
COG1BKR_G1BKR0_MASK                      equ 0001h
COG1BKR_G1BKR1_POSN                      equ 0001h
COG1BKR_G1BKR1_POSITION                  equ 0001h
COG1BKR_G1BKR1_SIZE                      equ 0001h
COG1BKR_G1BKR1_LENGTH                    equ 0001h
COG1BKR_G1BKR1_MASK                      equ 0002h
COG1BKR_G1BKR2_POSN                      equ 0002h
COG1BKR_G1BKR2_POSITION                  equ 0002h
COG1BKR_G1BKR2_SIZE                      equ 0001h
COG1BKR_G1BKR2_LENGTH                    equ 0001h
COG1BKR_G1BKR2_MASK                      equ 0004h
COG1BKR_G1BKR3_POSN                      equ 0003h
COG1BKR_G1BKR3_POSITION                  equ 0003h
COG1BKR_G1BKR3_SIZE                      equ 0001h
COG1BKR_G1BKR3_LENGTH                    equ 0001h
COG1BKR_G1BKR3_MASK                      equ 0008h

// Register: COG1BKF
#define COG1BKF COG1BKF
COG1BKF                                  equ 0195h
// bitfield definitions
COG1BKF_G1BKF_POSN                       equ 0000h
COG1BKF_G1BKF_POSITION                   equ 0000h
COG1BKF_G1BKF_SIZE                       equ 0004h
COG1BKF_G1BKF_LENGTH                     equ 0004h
COG1BKF_G1BKF_MASK                       equ 000Fh
COG1BKF_G1BKF0_POSN                      equ 0000h
COG1BKF_G1BKF0_POSITION                  equ 0000h
COG1BKF_G1BKF0_SIZE                      equ 0001h
COG1BKF_G1BKF0_LENGTH                    equ 0001h
COG1BKF_G1BKF0_MASK                      equ 0001h
COG1BKF_G1BKF1_POSN                      equ 0001h
COG1BKF_G1BKF1_POSITION                  equ 0001h
COG1BKF_G1BKF1_SIZE                      equ 0001h
COG1BKF_G1BKF1_LENGTH                    equ 0001h
COG1BKF_G1BKF1_MASK                      equ 0002h
COG1BKF_G1BKF2_POSN                      equ 0002h
COG1BKF_G1BKF2_POSITION                  equ 0002h
COG1BKF_G1BKF2_SIZE                      equ 0001h
COG1BKF_G1BKF2_LENGTH                    equ 0001h
COG1BKF_G1BKF2_MASK                      equ 0004h
COG1BKF_G1BKF3_POSN                      equ 0003h
COG1BKF_G1BKF3_POSITION                  equ 0003h
COG1BKF_G1BKF3_SIZE                      equ 0001h
COG1BKF_G1BKF3_LENGTH                    equ 0001h
COG1BKF_G1BKF3_MASK                      equ 0008h

// Register: COG1DBR
#define COG1DBR COG1DBR
COG1DBR                                  equ 0196h
// bitfield definitions
COG1DBR_G1DBR_POSN                       equ 0000h
COG1DBR_G1DBR_POSITION                   equ 0000h
COG1DBR_G1DBR_SIZE                       equ 0004h
COG1DBR_G1DBR_LENGTH                     equ 0004h
COG1DBR_G1DBR_MASK                       equ 000Fh
COG1DBR_G1DBR0_POSN                      equ 0000h
COG1DBR_G1DBR0_POSITION                  equ 0000h
COG1DBR_G1DBR0_SIZE                      equ 0001h
COG1DBR_G1DBR0_LENGTH                    equ 0001h
COG1DBR_G1DBR0_MASK                      equ 0001h
COG1DBR_G1DBR1_POSN                      equ 0001h
COG1DBR_G1DBR1_POSITION                  equ 0001h
COG1DBR_G1DBR1_SIZE                      equ 0001h
COG1DBR_G1DBR1_LENGTH                    equ 0001h
COG1DBR_G1DBR1_MASK                      equ 0002h
COG1DBR_G1DBR2_POSN                      equ 0002h
COG1DBR_G1DBR2_POSITION                  equ 0002h
COG1DBR_G1DBR2_SIZE                      equ 0001h
COG1DBR_G1DBR2_LENGTH                    equ 0001h
COG1DBR_G1DBR2_MASK                      equ 0004h
COG1DBR_G1DBR3_POSN                      equ 0003h
COG1DBR_G1DBR3_POSITION                  equ 0003h
COG1DBR_G1DBR3_SIZE                      equ 0001h
COG1DBR_G1DBR3_LENGTH                    equ 0001h
COG1DBR_G1DBR3_MASK                      equ 0008h

