GopalSaraf/Practicals/PSDL/include/proc/pic16f753.inc
// Register: COG1ASD0
#define COG1ASD0 COG1ASD0
COG1ASD0                                 equ 019Eh
// bitfield definitions
COG1ASD0_G1ASD0L_POSN                    equ 0002h
COG1ASD0_G1ASD0L_POSITION                equ 0002h
COG1ASD0_G1ASD0L_SIZE                    equ 0002h
COG1ASD0_G1ASD0L_LENGTH                  equ 0002h
COG1ASD0_G1ASD0L_MASK                    equ 000Ch
COG1ASD0_G1ASD1L_POSN                    equ 0004h
COG1ASD0_G1ASD1L_POSITION                equ 0004h
COG1ASD0_G1ASD1L_SIZE                    equ 0002h
COG1ASD0_G1ASD1L_LENGTH                  equ 0002h
COG1ASD0_G1ASD1L_MASK                    equ 0030h
COG1ASD0_G1ARSEN_POSN                    equ 0006h
COG1ASD0_G1ARSEN_POSITION                equ 0006h
COG1ASD0_G1ARSEN_SIZE                    equ 0001h
COG1ASD0_G1ARSEN_LENGTH                  equ 0001h
COG1ASD0_G1ARSEN_MASK                    equ 0040h
COG1ASD0_G1ASDE_POSN                     equ 0007h
COG1ASD0_G1ASDE_POSITION                 equ 0007h
COG1ASD0_G1ASDE_SIZE                     equ 0001h
COG1ASD0_G1ASDE_LENGTH                   equ 0001h
COG1ASD0_G1ASDE_MASK                     equ 0080h
COG1ASD0_G1ASD0L0_POSN                   equ 0002h
COG1ASD0_G1ASD0L0_POSITION               equ 0002h
COG1ASD0_G1ASD0L0_SIZE                   equ 0001h
COG1ASD0_G1ASD0L0_LENGTH                 equ 0001h
COG1ASD0_G1ASD0L0_MASK                   equ 0004h
COG1ASD0_G1ASD0L1_POSN                   equ 0003h
COG1ASD0_G1ASD0L1_POSITION               equ 0003h
COG1ASD0_G1ASD0L1_SIZE                   equ 0001h
COG1ASD0_G1ASD0L1_LENGTH                 equ 0001h
COG1ASD0_G1ASD0L1_MASK                   equ 0008h
COG1ASD0_G1ASD1L0_POSN                   equ 0004h
COG1ASD0_G1ASD1L0_POSITION               equ 0004h
COG1ASD0_G1ASD1L0_SIZE                   equ 0001h
COG1ASD0_G1ASD1L0_LENGTH                 equ 0001h
COG1ASD0_G1ASD1L0_MASK                   equ 0010h
COG1ASD0_G1ASD1L1_POSN                   equ 0005h
COG1ASD0_G1ASD1L1_POSITION               equ 0005h
COG1ASD0_G1ASD1L1_SIZE                   equ 0001h
COG1ASD0_G1ASD1L1_LENGTH                 equ 0001h
COG1ASD0_G1ASD1L1_MASK                   equ 0020h

// Register: COG1ASD1
#define COG1ASD1 COG1ASD1
COG1ASD1                                 equ 019Fh
// bitfield definitions
COG1ASD1_G1ASDSFLT_POSN                  equ 0000h
COG1ASD1_G1ASDSFLT_POSITION              equ 0000h
COG1ASD1_G1ASDSFLT_SIZE                  equ 0001h
COG1ASD1_G1ASDSFLT_LENGTH                equ 0001h
COG1ASD1_G1ASDSFLT_MASK                  equ 0001h
COG1ASD1_G1ASDSC1_POSN                   equ 0001h
COG1ASD1_G1ASDSC1_POSITION               equ 0001h
COG1ASD1_G1ASDSC1_SIZE                   equ 0001h
COG1ASD1_G1ASDSC1_LENGTH                 equ 0001h
COG1ASD1_G1ASDSC1_MASK                   equ 0002h
COG1ASD1_G1ASDSC2_POSN                   equ 0002h
COG1ASD1_G1ASDSC2_POSITION               equ 0002h
COG1ASD1_G1ASDSC2_SIZE                   equ 0001h
COG1ASD1_G1ASDSC2_LENGTH                 equ 0001h
COG1ASD1_G1ASDSC2_MASK                   equ 0004h
COG1ASD1_G1ASDSHLT1_POSN                 equ 0003h
COG1ASD1_G1ASDSHLT1_POSITION             equ 0003h
COG1ASD1_G1ASDSHLT1_SIZE                 equ 0001h
COG1ASD1_G1ASDSHLT1_LENGTH               equ 0001h
COG1ASD1_G1ASDSHLT1_MASK                 equ 0008h
COG1ASD1_G1ASDSHLT2_POSN                 equ 0004h
COG1ASD1_G1ASDSHLT2_POSITION             equ 0004h
COG1ASD1_G1ASDSHLT2_SIZE                 equ 0001h
COG1ASD1_G1ASDSHLT2_LENGTH               equ 0001h
COG1ASD1_G1ASDSHLT2_MASK                 equ 0010h

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 07FFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 07Fh)
#endif
#define ADCS0                            BANKMASK(ADCON1), 4
#define ADCS1                            BANKMASK(ADCON1), 5
#define ADCS2                            BANKMASK(ADCON1), 6
#define ADFM                             BANKMASK(ADCON0), 7
#define ADIE                             BANKMASK(PIE1), 6
#define ADIF                             BANKMASK(PIR1), 6
#define ADON                             BANKMASK(ADCON0), 0
#define ADPREF1                          BANKMASK(ADCON1), 0
#define ANSA0                            BANKMASK(ANSELA), 0
#define ANSA1                            BANKMASK(ANSELA), 1
#define ANSA2                            BANKMASK(ANSELA), 2
#define ANSA4                            BANKMASK(ANSELA), 4
#define ANSC0                            BANKMASK(ANSELC), 0
#define ANSC1                            BANKMASK(ANSELC), 1
#define ANSC2                            BANKMASK(ANSELC), 2
#define ANSC3                            BANKMASK(ANSELC), 3
#define C1HYS                            BANKMASK(CM1CON0), 1
#define C1IE                             BANKMASK(PIE2), 4
#define C1IF                             BANKMASK(PIR2), 4
#define C1INTN                           BANKMASK(CM1CON1), 6
#define C1INTP                           BANKMASK(CM1CON1), 7
#define C1NCH0                           BANKMASK(CM1CON1), 0
#define C1NCH1                           BANKMASK(CM1CON1), 1
#define C1NCH2                           BANKMASK(CM1CON1), 2
#define C1OE                             BANKMASK(CM1CON0), 5
#define C1ON                             BANKMASK(CM1CON0), 7
#define C1OUT                            BANKMASK(CM1CON0), 6
#define C1PCH0                           BANKMASK(CM1CON1), 3
#define C1PCH1                           BANKMASK(CM1CON1), 4
#define C1PCH2                           BANKMASK(CM1CON1), 5
#define C1POL                            BANKMASK(CM1CON0), 4
#define C1RICCP1                         BANKMASK(COG1RIS), 2
#define C1SP                             BANKMASK(CM1CON0), 2
#define C1SYNC                           BANKMASK(CM1CON0), 0
#define C1ZLF                            BANKMASK(CM1CON0), 3
#define C2HYS                            BANKMASK(CM2CON0), 1
#define C2IE                             BANKMASK(PIE2), 5
#define C2IF                             BANKMASK(PIR2), 5
#define C2INTN                           BANKMASK(CM2CON1), 6
#define C2INTP                           BANKMASK(CM2CON1), 7
#define C2NCH0                           BANKMASK(CM2CON1), 0
#define C2NCH1                           BANKMASK(CM2CON1), 1
#define C2NCH2                           BANKMASK(CM2CON1), 2
#define C2OE                             BANKMASK(CM2CON0), 5
#define C2ON                             BANKMASK(CM2CON0), 7
#define C2OUT                            BANKMASK(CM2CON0), 6
#define C2PCH0                           BANKMASK(CM2CON1), 3
#define C2PCH1                           BANKMASK(CM2CON1), 4
#define C2PCH2                           BANKMASK(CM2CON1), 5
#define C2POL                            BANKMASK(CM2CON0), 4
#define C2SP                             BANKMASK(CM2CON0), 2
#define C2SYNC                           BANKMASK(CM2CON0), 0
#define C2ZLF                            BANKMASK(CM2CON0), 3
#define CARRY                            BANKMASK(STATUS), 0
#define CCP1IE                           BANKMASK(PIE2), 0
#define CCP1IF                           BANKMASK(PIR2), 0
#define CCP1M0                           BANKMASK(CCP1CON), 0
#define CCP1M1                           BANKMASK(CCP1CON), 1
#define CCP1M2                           BANKMASK(CCP1CON), 2
#define CCP1M3                           BANKMASK(CCP1CON), 3
#define CHS0                             BANKMASK(ADCON0), 2
#define CHS1                             BANKMASK(ADCON0), 3
#define CHS2                             BANKMASK(ADCON0), 4
#define CHS3                             BANKMASK(ADCON0), 5
#define COG1IE                           BANKMASK(PIE2), 2
#define COG1IF                           BANKMASK(PIR2), 2
#define DACEN                            BANKMASK(DAC1CON0), 7
#define DACFM                            BANKMASK(DAC1CON0), 6
#define DACOE                            BANKMASK(DAC1CON0), 5
#define DACPSS0                          BANKMASK(DAC1CON0), 2
#define DACPSS1                          BANKMASK(DAC1CON0), 3
#define DC                               BANKMASK(STATUS), 1
#define DC1B0                            BANKMASK(CCP1CON), 4
#define DC1B1                            BANKMASK(CCP1CON), 5
#define FVRBUFEN                         BANKMASK(FVR1CON0), 0
#define FVRBUSS0                         BANKMASK(FVR1CON0), 3
#define FVRBUSS1                         BANKMASK(FVR1CON0), 4
#define FVREN                            BANKMASK(FVR1CON0), 7
#define FVROE                            BANKMASK(FVR1CON0), 5
#define FVRRDY                           BANKMASK(FVR1CON0), 6
#define G1ARSEN                          BANKMASK(COG1ASD0), 6
#define G1ASD0L0                         BANKMASK(COG1ASD0), 2
#define G1ASD0L1                         BANKMASK(COG1ASD0), 3
#define G1ASD1L0                         BANKMASK(COG1ASD0), 4
#define G1ASD1L1                         BANKMASK(COG1ASD0), 5
#define G1ASDE                           BANKMASK(COG1ASD0), 7
#define G1ASDSC1                         BANKMASK(COG1ASD1), 1
#define G1ASDSC2                         BANKMASK(COG1ASD1), 2
#define G1ASDSFLT                        BANKMASK(COG1ASD1), 0
#define G1ASDSHLT1                       BANKMASK(COG1ASD1), 3
#define G1ASDSHLT2                       BANKMASK(COG1ASD1), 4
#define G1BKF0                           BANKMASK(COG1BKF), 0
#define G1BKF1                           BANKMASK(COG1BKF), 1
#define G1BKF2                           BANKMASK(COG1BKF), 2
#define G1BKF3                           BANKMASK(COG1BKF), 3
#define G1BKR0                           BANKMASK(COG1BKR), 0
#define G1BKR1                           BANKMASK(COG1BKR), 1
#define G1BKR2                           BANKMASK(COG1BKR), 2
#define G1BKR3                           BANKMASK(COG1BKR), 3
#define G1CS0                            BANKMASK(COG1CON1), 0
#define G1CS1                            BANKMASK(COG1CON1), 1
#define G1DBF0                           BANKMASK(COG1DBF), 0
#define G1DBF1                           BANKMASK(COG1DBF), 1
#define G1DBF2                           BANKMASK(COG1DBF), 2
#define G1DBF3                           BANKMASK(COG1DBF), 3
#define G1DBR0                           BANKMASK(COG1DBR), 0
#define G1DBR1                           BANKMASK(COG1DBR), 1
#define G1DBR2                           BANKMASK(COG1DBR), 2
#define G1DBR3                           BANKMASK(COG1DBR), 3
#define G1EN                             BANKMASK(COG1CON0), 7
#define G1FDBTS                          BANKMASK(COG1CON1), 6
#define G1FIC1                           BANKMASK(COG1FIS), 0
#define G1FIC2                           BANKMASK(COG1FIS), 1
#define G1FICCP1                         BANKMASK(COG1FIS), 2
#define G1FIFLT                          BANKMASK(COG1FIS), 3
#define G1FIHLT1                         BANKMASK(COG1FIS), 5
#define G1FIHLT2                         BANKMASK(COG1FIS), 6
#define G1FIT2M                          BANKMASK(COG1FIS), 4
#define G1FMC1                           BANKMASK(COG1FSIM), 0
#define G1FMC2                           BANKMASK(COG1FSIM), 1
#define G1FMCCP1                         BANKMASK(COG1FSIM), 2
#define G1FMFLT                          BANKMASK(COG1FSIM), 3
#define G1FMHLT1                         BANKMASK(COG1FSIM), 5
#define G1FMHLT2                         BANKMASK(COG1FSIM), 6
#define G1FMT2M                          BANKMASK(COG1FSIM), 4
#define G1LD                             BANKMASK(COG1CON0), 2
#define G1MD                             BANKMASK(COG1CON0), 0
#define G1OE0                            BANKMASK(COG1CON0), 5
#define G1OE1                            BANKMASK(COG1CON0), 6
#define G1PHF0                           BANKMASK(COG1PHF), 0
#define G1PHF1                           BANKMASK(COG1PHF), 1
#define G1PHF2                           BANKMASK(COG1PHF), 2
#define G1PHF3                           BANKMASK(COG1PHF), 3
#define G1PHR0                           BANKMASK(COG1PHR), 0
#define G1PHR1                           BANKMASK(COG1PHR), 1
#define G1PHR2                           BANKMASK(COG1PHR), 2
#define G1PHR3                           BANKMASK(COG1PHR), 3
#define G1POL0                           BANKMASK(COG1CON0), 3
#define G1POL1                           BANKMASK(COG1CON0), 4
#define G1R1HLT1                         BANKMASK(COG1RIS), 5
#define G1RDBTS                          BANKMASK(COG1CON1), 7
#define G1RIC1                           BANKMASK(COG1RIS), 0
#define G1RIC2                           BANKMASK(COG1RIS), 1
#define G1RIFLT                          BANKMASK(COG1RIS), 3
#define G1RIHLT2                         BANKMASK(COG1RIS), 6
#define G1RIT2M                          BANKMASK(COG1RIS), 4
#define G1RMC1                           BANKMASK(COG1RSIM), 0
#define G1RMC2                           BANKMASK(COG1RSIM), 1
#define G1RMCCP1                         BANKMASK(COG1RSIM), 2
#define G1RMFLT                          BANKMASK(COG1RSIM), 3
#define G1RMHLT1                         BANKMASK(COG1RSIM), 5
#define G1RMHLT2                         BANKMASK(COG1RSIM), 6
#define G1RTM2M                          BANKMASK(COG1RSIM), 4
#define GIE                              BANKMASK(INTCON), 7
#define GO_nDONE                         BANKMASK(ADCON0), 1
#define H1CKPS0                          BANKMASK(HLT1CON0), 0
#define H1CKPS1                          BANKMASK(HLT1CON0), 1
#define H1ERS0                           BANKMASK(HLT1CON1), 2
#define H1ERS1                           BANKMASK(HLT1CON1), 3
#define H1ERS2                           BANKMASK(HLT1CON1), 4
#define H1FEREN                          BANKMASK(HLT1CON1), 1
#define H1FES                            BANKMASK(HLT1CON1), 7
#define H1ON                             BANKMASK(HLT1CON0), 2
#define H1OUTPS0                         BANKMASK(HLT1CON0), 3
#define H1OUTPS1                         BANKMASK(HLT1CON0), 4
#define H1OUTPS2                         BANKMASK(HLT1CON0), 5
#define H1OUTPS3                         BANKMASK(HLT1CON0), 6
#define H1REREN                          BANKMASK(HLT1CON1), 0
#define H1RES                            BANKMASK(HLT1CON1), 6
#define H2CKPS0                          BANKMASK(HLT2CON0), 0
#define H2CKPS1                          BANKMASK(HLT2CON0), 1
#define H2ERS0                           BANKMASK(HLT2CON1), 2
#define H2ERS1                           BANKMASK(HLT2CON1), 3
#define H2ERS2                           BANKMASK(HLT2CON1), 4
#define H2FEREN                          BANKMASK(HLT2CON1), 1
#define H2FES                            BANKMASK(HLT2CON1), 7
#define H2ON                             BANKMASK(HLT2CON0), 2
#define H2OUTPS0                         BANKMASK(HLT2CON0), 3
#define H2OUTPS1                         BANKMASK(HLT2CON0), 4
#define H2OUTPS2                         BANKMASK(HLT2CON0), 5
#define H2OUTPS3                         BANKMASK(HLT2CON0), 6
#define H2REREN                          BANKMASK(HLT2CON1), 0
#define H2RES                            BANKMASK(HLT2CON1), 6
#define HLTMR1IE                         BANKMASK(PIE1), 2
#define HLTMR1IF                         BANKMASK(PIR1), 2
#define HLTMR2IE                         BANKMASK(PIE1), 3
#define HLTMR2IF                         BANKMASK(PIR1), 3
#define HTS                              BANKMASK(OSCCON), 2
#define INTE                             BANKMASK(INTCON), 4
#define INTEDG                           BANKMASK(OPTION_REG), 6
#define INTF                             BANKMASK(INTCON), 1
#define IOCAF0                           BANKMASK(IOCAF), 0
#define IOCAF1                           BANKMASK(IOCAF), 1
#define IOCAF2                           BANKMASK(IOCAF), 2
#define IOCAF3                           BANKMASK(IOCAF), 3
#define IOCAF4                           BANKMASK(IOCAF), 4
#define IOCAF5                           BANKMASK(IOCAF), 5
#define IOCAN0                           BANKMASK(IOCAN), 0
#define IOCAN1                           BANKMASK(IOCAN), 1
#define IOCAN2                           BANKMASK(IOCAN), 2
#define IOCAN3                           BANKMASK(IOCAN), 3
#define IOCAN4                           BANKMASK(IOCAN), 4
#define IOCAN5                           BANKMASK(IOCAN), 5
#define IOCAP0                           BANKMASK(IOCAP), 0
#define IOCAP1                           BANKMASK(IOCAP), 1
#define IOCAP2                           BANKMASK(IOCAP), 2
#define IOCAP3                           BANKMASK(IOCAP), 3
#define IOCAP4                           BANKMASK(IOCAP), 4
#define IOCAP5                           BANKMASK(IOCAP), 5
#define IOCCF0                           BANKMASK(IOCCF), 0
#define IOCCF1                           BANKMASK(IOCCF), 1
#define IOCCF2                           BANKMASK(IOCCF), 2
#define IOCCF3                           BANKMASK(IOCCF), 3
#define IOCCF4                           BANKMASK(IOCCF), 4
#define IOCCF5                           BANKMASK(IOCCF), 5
#define IOCCN0                           BANKMASK(IOCCN), 0
#define IOCCN1                           BANKMASK(IOCCN), 1
#define IOCCN2                           BANKMASK(IOCCN), 2
#define IOCCN3                           BANKMASK(IOCCN), 3
#define IOCCN4                           BANKMASK(IOCCN), 4
#define IOCCN5                           BANKMASK(IOCCN), 5
#define IOCCP0                           BANKMASK(IOCCP), 0
#define IOCCP1                           BANKMASK(IOCCP), 1
#define IOCCP2                           BANKMASK(IOCCP), 2
#define IOCCP3                           BANKMASK(IOCCP), 3
#define IOCCP4                           BANKMASK(IOCCP), 4
#define IOCCP5                           BANKMASK(IOCCP), 5
#define IOCIE                            BANKMASK(INTCON), 3
#define IOCIF                            BANKMASK(INTCON), 0
#define IRCF0                            BANKMASK(OSCCON), 4
#define IRCF1                            BANKMASK(OSCCON), 5
#define LATA0                            BANKMASK(LATA), 0
#define LATA1                            BANKMASK(LATA), 1
#define LATA2                            BANKMASK(LATA), 2
#define LATA4                            BANKMASK(LATA), 4
#define LATA5                            BANKMASK(LATA), 5
#define LATC0                            BANKMASK(LATC), 0
#define LATC1                            BANKMASK(LATC), 1
#define LATC2                            BANKMASK(LATC), 2
#define LATC3                            BANKMASK(LATC), 3
#define LATC4                            BANKMASK(LATC), 4
#define LATC5                            BANKMASK(LATC), 5
#define LTS                              BANKMASK(OSCCON), 1
#define MCOUT1                           BANKMASK(CMOUT), 0
#define MCOUT2                           BANKMASK(CMOUT), 1
#define OPA1NCH0                         BANKMASK(OPA1CON), 2
#define OPA1NCH1                         BANKMASK(OPA1CON), 3
#define OPA1PCH0                         BANKMASK(OPA1CON), 0
#define OPA1PCH1                         BANKMASK(OPA1CON), 1
#define OPAEN                            BANKMASK(OPA1CON), 7
#define OPAUGM                           BANKMASK(OPA1CON), 4
#define PEIE                             BANKMASK(INTCON), 6
#define PS0                              BANKMASK(OPTION_REG), 0
#define PS1                              BANKMASK(OPTION_REG), 1
#define PS2                              BANKMASK(OPTION_REG), 2
#define PSA                              BANKMASK(OPTION_REG), 3
#define RA0                              BANKMASK(PORTA), 0
#define RA1                              BANKMASK(PORTA), 1
#define RA2                              BANKMASK(PORTA), 2
#define RA3                              BANKMASK(PORTA), 3
#define RA4                              BANKMASK(PORTA), 4
#define RA5                              BANKMASK(PORTA), 5
#define RC0                              BANKMASK(PORTC), 0
#define RC1                              BANKMASK(PORTC), 1
#define RC2                              BANKMASK(PORTC), 2
#define RC3                              BANKMASK(PORTC), 3
#define RC4                              BANKMASK(PORTC), 4
#define RC5                              BANKMASK(PORTC), 5
#define RD                               BANKMASK(PMCON1), 0
#define RP0                              BANKMASK(STATUS), 5
#define RP1                              BANKMASK(STATUS), 6
#define SC1EN                            BANKMASK(SLPC1CON0), 7
#define SC1INS                           BANKMASK(SLPC1CON0), 0
#define SC1ISET0                         BANKMASK(SLPC1CON1), 0
#define SC1ISET1                         BANKMASK(SLPC1CON1), 1
#define SC1ISET2                         BANKMASK(SLPC1CON1), 2
#define SC1ISET3                         BANKMASK(SLPC1CON1), 3
#define SC1MRPE                          BANKMASK(SLPC1CON0), 5
#define SC1POL                           BANKMASK(SLPC1CON0), 4
#define SC1RNG                           BANKMASK(SLPC1CON1), 4
#define SCS1TSS0                         BANKMASK(SLPC1CON0), 2
#define SCS1TSS1                         BANKMASK(SLPC1CON0), 3
#define SLRC4                            BANKMASK(SLRCONC), 4
#define SLRC5                            BANKMASK(SLRCONC), 5
#define T0CS                             BANKMASK(OPTION_REG), 5
#define T0IE                             BANKMASK(INTCON), 5
#define T0IF                             BANKMASK(INTCON), 2
#define T0SE                             BANKMASK(OPTION_REG), 4
#define T1CKPS0                          BANKMASK(T1CON), 4
#define T1CKPS1                          BANKMASK(T1CON), 5
#define T1GGO                            BANKMASK(T1GCON), 3
#define T1GGO_nDONE                      BANKMASK(T1GCON), 3
#define T1GPOL                           BANKMASK(T1GCON), 6
#define T1GSEL                           BANKMASK(APFCON), 4
#define T1GSPM                           BANKMASK(T1GCON), 4
#define T1GSS0                           BANKMASK(T1GCON), 0
#define T1GSS1                           BANKMASK(T1GCON), 1
#define T1GTM                            BANKMASK(T1GCON), 5
#define T1GVAL                           BANKMASK(T1GCON), 2
#define T2CKPS0                          BANKMASK(T2CON), 0
#define T2CKPS1                          BANKMASK(T2CON), 1
#define T2OUTPS0                         BANKMASK(T2CON), 3
#define T2OUTPS1                         BANKMASK(T2CON), 4
#define T2OUTPS2                         BANKMASK(T2CON), 5
#define T2OUTPS3                         BANKMASK(T2CON), 6
#define TMR1CS0                          BANKMASK(T1CON), 6
#define TMR1CS1                          BANKMASK(T1CON), 7
#define TMR1GE                           BANKMASK(T1GCON), 7
#define TMR1GIE                          BANKMASK(PIE1), 7
#define TMR1GIF                          BANKMASK(PIR1), 7
#define TMR1IE                           BANKMASK(PIE1), 0
#define TMR1IF                           BANKMASK(PIR1), 0
#define TMR1ON                           BANKMASK(T1CON), 0
#define TMR2IE                           BANKMASK(PIE1), 1
#define TMR2IF                           BANKMASK(PIR1), 1
#define TMR2ON                           BANKMASK(T2CON), 2
#define TRISA0                           BANKMASK(TRISA), 0
#define TRISA1                           BANKMASK(TRISA), 1
#define TRISA2                           BANKMASK(TRISA), 2
#define TRISA3                           BANKMASK(TRISA), 3
#define TRISA4                           BANKMASK(TRISA), 4
#define TRISA5                           BANKMASK(TRISA), 5
#define TRISC0                           BANKMASK(TRISC), 0
#define TRISC1                           BANKMASK(TRISC), 1
#define TRISC2                           BANKMASK(TRISC), 2
#define TRISC3                           BANKMASK(TRISC), 3
#define TRISC4                           BANKMASK(TRISC), 4
#define TRISC5                           BANKMASK(TRISC), 5
#define TUN0                             BANKMASK(OSCTUNE), 0
